In [1]:
import pandas as pd

# Series

In [6]:
record1 = pd.Series({"Name": "Alex",
                    "Class": "Physics",
                    "Score": 85})
record1

Name        Alex
Class    Physics
Score         85
dtype: object

In [7]:
record2 = pd.Series({"Name": "John",
                    "Class": "Math",
                    "Score": 88})
record1

Name        Alex
Class    Physics
Score         85
dtype: object

In [8]:
df = pd.DataFrame([record1, record2], index = ['school1', 'school2'])
df

         Name    Class  Score
school1  Alex  Physics     85
school2  John     Math     88

In [9]:
df.head(1)

         Name    Class  Score
school1  Alex  Physics     85

In [10]:
type(df)

pandas.core.frame.DataFrame

# Comparing Series & Dataframe

In [12]:
import numpy as np
import matplotlib.pyplot as plt

In [14]:
s = pd.Series([1, 2, 3, 4, 5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
pd.Series([30, 35, 40], index = ['2015 Sales', '2016 Sales', '2017 Sales'], name = 'Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [18]:
df = pd.DataFrame({'High': [20, 10, 40, 23, 34],
                  'Low': [14, 18, 12, 19, 25]}, 
                 index = ['Austin', 'Los Angeles', 'Seattle', 'Nashville', 'Salt Lake City'])
df

                High  Low
Austin            20   14
Los Angeles       10   18
Seattle           40   12
Nashville         23   19
Salt Lake City    34   25

In [21]:
my_dict = {'a': 1, 'aa': 2}, {'b': 3}, {'c': 4}
my_dict

({'a': 1, 'aa': 2}, {'b': 3}, {'c': 4})

In [23]:
s = pd.Series(my_dict)
s

0    {'a': 1, 'aa': 2}
1             {'b': 3}
2             {'c': 4}
dtype: object

In [24]:
df = pd.DataFrame(my_dict)
df

     a   aa    b    c
0  1.0  2.0  NaN  NaN
1  NaN  NaN  3.0  NaN
2  NaN  NaN  NaN  4.0

# Read in TSLA Dataset

In [29]:
tsla = pd.read_csv('./TSLA.csv')
tsla

,Date,Open,High,Low,Close,Adj Close,Volume
0,2020-09-21,453.130005,455.679993,407.070007,449.390015,449.390015,109476800
1,2020-09-22,429.600006,437.760010,417.600006,424.230011,424.230011,79580800
2,2020-09-23,405.160004,412.149994,375.880005,380.359985,380.359985,95074200
3,2020-09-24,363.799988,399.500000,351.299988,387.790009,387.790009,96561100
4,2020-09-25,393.470001,408.730011,391.299988,407.339996,407.339996,67208500
...,...,...,...,...,...,...,...
247,2021-09-14,742.570007,754.469971,736.400024,744.489990,744.489990,18524900
248,2021-09-15,745.000000,756.859985,738.359985,755.830017,755.830017,15357700
249,2021-09-16,752.830017,758.909973,747.609985,756.989990,756.989990,13923400
250,2021-09-17,757.150024,761.039978,750.000000,759.489990,759.489990,28186100
251,2021-09-20,734.557983,742.000000,724.460022,729.539978,729.539978,11094579

In [30]:
tsla.head(10)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2020-09-21,453.130005,455.679993,407.070007,449.390015,449.390015,109476800
1,2020-09-22,429.600006,437.760010,417.600006,424.230011,424.230011,79580800
2,2020-09-23,405.160004,412.149994,375.880005,380.359985,380.359985,95074200
3,2020-09-24,363.799988,399.500000,351.299988,387.790009,387.790009,96561100
4,2020-09-25,393.470001,408.730011,391.299988,407.339996,407.339996,67208500
5,2020-09-28,424.619995,428.079987,415.549988,421.200012,421.200012,49719600
6,2020-09-29,416.000000,428.500000,411.600006,419.070007,419.070007,50219300
7,2020-09-30,421.320007,433.929993,420.470001,429.010010,429.010010,48145600
8,2020-10-01,440.760010,448.880005,434.420013,448.160004,448.160004,50741500
9,2020-10-02,421.390015,439.130005,415.000000,415.089996,415.089996,71430000

In [33]:
column_names = tsla.columns
column_names
tsla.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

# Index-Based Selection (iloc)

In [40]:
tsla.iloc[0]

Date         2020-09-21
Open         453.130005
High         455.679993
Low          407.070007
Close        449.390015
Adj Close    449.390015
Volume        109476800
Name: 0, dtype: object

In [39]:
# First row, second row, fourth row - first column
tsla.iloc[[0, 1, 3], 0]

0    2020-09-21
1    2020-09-22
3    2020-09-24
Name: Date, dtype: object

# Label-Based Selection (loc)

In [41]:
tsla.loc[0]['Close']

449.390015

In [42]:
tsla.set_index('Date', inplace = True)

In [43]:
tsla.loc['2020-09-21']['Close']

449.390015

In [44]:
tsla.loc['2020-09-21', 'Close']

449.390015

In [ ]:
tsla.loc['2020-09-21', ['Close', 'High']